// Types
import type { Dropdown } from "../types/common";

export const mockOrg: Dropdown[] = [
  {
    code: "20001",
    name: "สำนักงานเลขานุการตำรวจแห่งชาติ"
  },
  {
    code: "40001",
    name: "ฝ่ายอำนวยการ สำนักงานเลขานุการตำรวจแห่งชาติ"
  },
  {
    code: "40002",
    name: "ฝ่ายสารบรรณ 1 สำนักงานเลขานุการตำรวจแห่งชาติ"
  },
  {
    code: "40003",
    name: "ฝ่ายบริการการประชุมและพิธีการ สำนักงานเลขานุการตำรวจแห่งชาติ"
  },
  {
    code: "40365",
    name: "ฝ่ายสารบรรณ 2 สำนักงานเลขานุการตำรวจแห่งชาติ"
  },
  {
    code: "40702",
    name: "กลุ่มงานวิชาการและงานสารบรรณ สำนักงานเลขานุการตำรวจแห่งชาติ"
  }
]