// Types
import type { Dropdown } from "../types/common";

export const mockProvince: Dropdown[] = [
  {
    code: "กรุงเทพมหานคร",
    name: "กรุงเทพมหานคร"
  },
  {
    code: "กระบี่",
    name: "กระบี่"
  },
  {
    code: "กาญจนบุรี",
    name: "กาญจนบุรี"
  },
  {
    code: "กาฬสินธุ์",
    name: "กาฬสินธุ์"
  },
  {
    code: "กำแพงเพชร",
    name: "กำแพงเพชร"
  },
  {
    code: "ขอนแก่น",
    name: "ขอนแก่น"
  },
  {
    code: "จันทบุรี",
    name: "จันทบุรี"
  },
  {
    code: "ฉะเชิงเทรา",
    name: "ฉะเชิงเทรา"
  },
  {
    code: "ชลบุรี",
    name: "ชลบุรี"
  },
  {
    code: "ชัยนาท",
    name: "ชัยนาท"
  },
  {
    code: "ชัยภูมิ",
    name: "ชัยภูมิ"
  },
  {
    code: "ชุมพร",
    name: "ชุมพร"
  },
  {
    code: "เชียงใหม่",
    name: "เชียงใหม่"
  },
  {
    code: "เชียงราย",
    name: "เชียงราย"
  },
  {
    code: "ตรัง",
    name: "ตรัง"
  },
  {
    code: "ตราด",
    name: "ตราด"
  },
  {
    code: "ตาก",
    name: "ตาก"
  },
  {
    code: "นครนายก",
    name: "นครนายก"
  },
  {
    code: "นครปฐม",
    name: "นครปฐม"
  },
  {
    code: "นครพนม",
    name: "นครพนม"
  },
  {
    code: "นครราชสีมา",
    name: "นครราชสีมา"
  },
  {
    code: "นครศรีธรรมราช",
    name: "นครศรีธรรมราช"
  },
  {
    code: "นครสวรรค์",
    name: "นครสวรรค์"
  },
  {
    code: "นนทบุรี",
    name: "นนทบุรี"
  },
  {
    code: "นราธิวาส",
    name: "นราธิวาส"
  },
  {
    code: "น่าน",
    name: "น่าน"
  },
  {
    code: "บึงกาฬ",
    name: "บึงกาฬ"
  },
  {
    code: "บุรีรัมย์",
    name: "บุรีรัมย์"
  },
  {
    code: "ปทุมธานี",
    name: "ปทุมธานี"
  },
  {
    code: "ประจวบคีรีขันธ์",
    name: "ประจวบคีรีขันธ์"
  },
  {
    code: "ปราจีนบุรี",
    name: "ปราจีนบุรี"
  },
  {
    code: "ปัตตานี",
    name: "ปัตตานี"
  },
  {
    code: "พระนครศรีอยุธยา",
    name: "พระนครศรีอยุธยา"
  },
  {
    code: "พะเยา",
    name: "พะเยา"
  },
  {
    code: "พังงา",
    name: "พังงา"
  },
  {
    code: "พัทลุง",
    name: "พัทลุง"
  },
  {
    code: "พิจิตร",
    name: "พิจิตร"
  },
  {
    code: "พิษณุโลก",
    name: "พิษณุโลก"
  },
  {
    code: "เพชรบุรี",
    name: "เพชรบุรี"
  },
  {
    code: "เพชรบูรณ์",
    name: "เพชรบูรณ์"
  },
  {
    code: "แพร่",
    name: "แพร่"
  },
  {
    code: "ภูเก็ต",
    name: "ภูเก็ต"
  },
  {
    code: "มหาสารคาม",
    name: "มหาสารคาม"
  },
  {
    code: "มุกดาหาร",
    name: "มุกดาหาร"
  },
  {
    code: "แม่ฮ่องสอน",
    name: "แม่ฮ่องสอน"
  },
  {
    code: "ยโสธร",
    name: "ยโสธร"
  },
  {
    code: "ยะลา",
    name: "ยะลา"
  },
  {
    code: "ร้อยเอ็ด",
    name: "ร้อยเอ็ด"
  },
  {
    code: "ระนอง",
    name: "ระนอง"
  },
  {
    code: "ระยอง",
    name: "ระยอง"
  },
  {
    code: "ราชบุรี",
    name: "ราชบุรี"
  },
  {
    code: "ลพบุรี",
    name: "ลพบุรี"
  },
  {
    code: "ลำปาง",
    name: "ลำปาง"
  },
  {
    code: "ลำพูน",
    name: "ลำพูน"
  },
  {
    code: "เลย",
    name: "เลย"
  },
  {
    code: "ศรีสะเกษ",
    name: "ศรีสะเกษ"
  },
  {
    code: "สกลนคร",
    name: "สกลนคร"
  },
  {
    code: "สงขลา",
    name: "สงขลา"
  },
  {
    code: "สตูล",
    name: "สตูล"
  },
  {
    code: "สมุทรปราการ",
    name: "สมุทรปราการ"
  },
  {
    code: "สมุทรสงคราม",
    name: "สมุทรสงคราม"
  },
  {
    code: "สมุทรสาคร",
    name: "สมุทรสาคร"
  },
  {
    code: "สระแก้ว",
    name: "สระแก้ว"
  },
  {
    code: "สระบุรี",
    name: "สระบุรี"
  },
  {
    code: "สิงห์บุรี",
    name: "สิงห์บุรี"
  },
  {
    code: "สุโขทัย",
    name: "สุโขทัย"
  },
  {
    code: "สุพรรณบุรี",
    name: "สุพรรณบุรี"
  },
  {
    code: "สุราษฎร์ธานี",
    name: "สุราษฎร์ธานี"
  },
  {
    code: "สุรินทร์",
    name: "สุรินทร์"
  },
  {
    code: "หนองคาย",
    name: "หนองคาย"
  },
  {
    code: "หนองบัวลำภู",
    name: "หนองบัวลำภู"
  },
  {
    code: "อ่างทอง",
    name: "อ่างทอง"
  },
  {
    code: "อำนาจเจริญ",
    name: "อำนาจเจริญ"
  },
  {
    code: "อุดรธานี",
    name: "อุดรธานี"
  },
  {
    code: "อุตรดิตถ์",
    name: "อุตรดิตถ์"
  },
  {
    code: "อุทัยธานี",
    name: "อุทัยธานี"
  },
  {
    code: "อุบลราชธานี",
    name: "อุบลราชธานี"
  },
  {
    code: "เบตง",
    name: "เบตง"
  }
]